#Data: Monthly transatlantic airtravel, in thousands of passengers, for 1958-1960. There are 4 fields, "Month", "1958", "1959" and "1960" and 12 records, "JAN" through "DEC".

#Q1: Import numpy and pandas

#Q2: Import visualization libraries

In [ ]:
from __future__ import print_function

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
pd.__version__

#Q3: Read in the csv file as a dataframe called data

In [20]:
data = pd.read_csv("airtravel.csv", header=None)
data.head()

     0    1    2    3
0  JAN  340  360  417
1  FEB  318  342  391
2  MAR  362  406  419
3  APR  348  396  461
4  MAY  363  420  472

#Q4: Check the info() of the data

In [21]:
print(data.dtypes)

0    object
1     int64
2     int64
3     int64
dtype: object

#Q5: Check the head of the data

In [25]:
data.columns = ['Month', '1958_passengers', '1959_passengers', '1960_passengers']
data.head()

  Month  1958_passengers  1959_passengers  1960_passengers
0   JAN              340              360              417
1   FEB              318              342              391
2   MAR              362              406              419
3   APR              348              396              461
4   MAY              363              420              472

#Q6: Code min function to find the smallest amount of passengers in a year

#Q7: Code max function to find the largest amount of passengers in a year

#Q8: Code mean function to find the average amount of passengers in a year

#Q9: Code the functions to draw boxplot chart for passengers in a year over 12 months

#Q10: Code the functions to detect abnormal amount of passengers. Count all the abnormal amount of passengers.